Revit 2027 API
BuiltInFailures.MultiReferenceAnnotationFailures Class
 Failures about MultiReferenceAnnotations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MultiReferenceAnnotationFailures
Public NotInheritable Class MultiReferenceAnnotationFailures
public ref class MultiReferenceAnnotationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MultiReferenceAnnotationFailures = class end
The BuiltInFailures.MultiReferenceAnnotationFailures type exposes the following members.
Properties
Name | Description
ElementCategoryChangeInvalidatesMultiReferenceAnnotation |  Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted.
MultiReferenceAnnotationReferenceCategoryForcesDeletion |  Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.
Top
See Also
Reference
Autodesk.Revit.DB Namespace